# GroupSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSetIterator Class
Members See Also
---
An iterator to a group set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class GroupSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class GroupSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class GroupSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GroupSetIterator
# See Also
GroupSetIterator Members
Autodesk.Revit.DB Namespace